---
kind: type
id: T:Autodesk.Revit.DB.ExportLinetypeKey
source: html/7f67a1c8-cc9b-9b17-aa87-664657ee9d7d.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey

A key used to represent an item stored in an ExportLinetypeTable .

## Syntax (C#)
```csharp
public class ExportLinetypeKey : IDisposable
```